p2p-bench/results/2026-06-16_5060ti-16gb_2cards_gen3-x4_p2p-sweep-c1-2-4-8/scenarios/p2p_on-c4/run_2.stdout.txt
WARNING 06-16 19:21:36 [cuda.py:838] Detected different devices in the system: NVIDIA GeForce RTX 5070, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti. Please make sure to set `CUDA_DEVICE_ORDER=PCI_BUS_ID` to avoid unexpected behavior.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x77fafff3b7e0>, trust_remote_code=False, seed=1234, num_prompts=64, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=1024, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url='http://127.0.0.1:8081', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=4, model='p2p_on-c4', input_len=None, output_len=None, tokenizer='/data/models/qwen3.6-27b-text-nvfp4-mtp', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=8, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='results/run1/scenarios/p2p_on-c4', result_filename='run_2.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-e80e3b4f-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 06-16 19:21:42 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [1024, 1024]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 8 requests...
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     64        
Failed requests:                         0         
Maximum request concurrency:             4         
Benchmark duration (s):                  394.62    
Total input tokens:                      65536     
Total generated tokens:                  65536     
Request throughput (req/s):              0.16      
Output token throughput (tok/s):         166.07    
Peak output token throughput (tok/s):    72.00     
Peak concurrent requests:                5.00      
Total token throughput (tok/s):          332.15    
---------------Time to First Token----------------
Mean TTFT (ms):                          951.01    
Median TTFT (ms):                        880.14    
P50 TTFT (ms):                           880.14    
P90 TTFT (ms):                           888.23    
P99 TTFT (ms):                           2960.48   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          22.75     
Median TPOT (ms):                        21.36     
P50 TPOT (ms):                           21.36     
P90 TPOT (ms):                           25.62     
P99 TPOT (ms):                           54.87     
---------------Inter-token Latency----------------
Mean ITL (ms):                           61.47     
Median ITL (ms):                         56.10     
P50 ITL (ms):                            56.10     
P90 ITL (ms):                            56.48     
P99 ITL (ms):                            57.99     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          24224.03  
Median E2EL (ms):                        22737.93  
P50 E2EL (ms):                           22737.93  
P90 E2EL (ms):                           27092.64  
P99 E2EL (ms):                           57001.46  
==================================================


  0%|          | 0/8 [00:00<?, ?it/s]
 12%|█▎        | 1/8 [00:17<02:01, 17.36s/it]
 25%|██▌       | 2/8 [00:18<00:46,  7.83s/it]
 38%|███▊      | 3/8 [00:18<00:21,  4.31s/it]
 50%|█████     | 4/8 [00:24<00:19,  4.98s/it]
 62%|██████▎   | 5/8 [00:36<00:21,  7.31s/it]
 75%|███████▌  | 6/8 [00:36<00:09,  4.88s/it]
 88%|████████▊ | 7/8 [00:39<00:04,  4.39s/it]
100%|██████████| 8/8 [00:40<00:00,  3.33s/it]
100%|██████████| 8/8 [00:40<00:00,  5.09s/it]

  0%|          | 0/64 [00:00<?, ?it/s]
  2%|▏         | 1/64 [00:17<18:27, 17.57s/it]
  3%|▎         | 2/64 [00:18<08:09,  7.89s/it]
  5%|▍         | 3/64 [00:22<06:13,  6.13s/it]
  6%|▋         | 4/64 [00:26<05:15,  5.25s/it]
  8%|▊         | 5/64 [00:35<06:33,  6.68s/it]
  9%|▉         | 6/64 [00:44<07:08,  7.39s/it]
 11%|█         | 7/64 [00:47<05:30,  5.80s/it]
 12%|█▎        | 8/64 [00:48<04:01,  4.30s/it]
 14%|█▍        | 9/64 [01:00<06:09,  6.72s/it]
 16%|█▌        | 10/64 [01:08<06:23,  7.11s/it]
 17%|█▋        | 11/64 [01:12<05:25,  6.15s/it]
 19%|█▉        | 12/64 [01:13<04:00,  4.63s/it]
 20%|██        | 13/64 [01:23<05:27,  6.42s/it]
 22%|██▏       | 14/64 [01:29<05:12,  6.24s/it]
 23%|██▎       | 15/64 [01:31<03:57,  4.85s/it]
 25%|██▌       | 16/64 [01:38<04:27,  5.57s/it]
 27%|██▋       | 17/64 [01:41<03:43,  4.75s/it]
 28%|██▊       | 18/64 [01:49<04:18,  5.61s/it]
 30%|██▉       | 19/64 [02:04<06:21,  8.48s/it]
 31%|███▏      | 20/64 [02:05<04:39,  6.35s/it]
 33%|███▎      | 21/64 [02:10<04:19,  6.02s/it]
 34%|███▍      | 22/64 [02:15<03:57,  5.64s/it]
 36%|███▌      | 23/64 [02:25<04:40,  6.83s/it]
 38%|███▊      | 24/64 [02:28<03:47,  5.68s/it]
 39%|███▉      | 25/64 [02:33<03:31,  5.42s/it]
 41%|████      | 26/64 [02:34<02:40,  4.22s/it]
 42%|████▏     | 27/64 [02:47<04:16,  6.94s/it]
 44%|████▍     | 28/64 [02:49<03:10,  5.29s/it]
 45%|████▌     | 29/64 [02:58<03:49,  6.54s/it]
 47%|████▋     | 30/64 [03:00<02:51,  5.03s/it]
 48%|████▊     | 31/64 [03:05<02:50,  5.17s/it]
 50%|█████     | 32/64 [03:16<03:43,  7.00s/it]
 52%|█████▏    | 33/64 [03:25<03:49,  7.42s/it]
 53%|█████▎    | 34/64 [03:27<02:51,  5.72s/it]
 55%|█████▍    | 35/64 [03:42<04:07,  8.55s/it]
 56%|█████▋    | 36/64 [03:46<03:23,  7.27s/it]
 58%|█████▊    | 37/64 [03:49<02:44,  6.10s/it]
 59%|█████▉    | 38/64 [03:59<03:05,  7.14s/it]
 61%|██████    | 39/64 [04:13<03:52,  9.29s/it]
 62%|██████▎   | 40/64 [04:16<02:55,  7.31s/it]
 64%|██████▍   | 41/64 [04:19<02:21,  6.17s/it]
 66%|██████▌   | 42/64 [04:27<02:23,  6.51s/it]
 67%|██████▋   | 43/64 [04:35<02:27,  7.02s/it]
 69%|██████▉   | 44/64 [04:39<02:00,  6.03s/it]
 70%|███████   | 45/64 [04:40<01:27,  4.61s/it]
 72%|███████▏  | 46/64 [04:49<01:46,  5.91s/it]
 73%|███████▎  | 47/64 [04:56<01:44,  6.15s/it]
 75%|███████▌  | 48/64 [04:59<01:24,  5.27s/it]
 77%|███████▋  | 49/64 [05:02<01:09,  4.66s/it]
 78%|███████▊  | 50/64 [05:12<01:26,  6.17s/it]
 80%|███████▉  | 51/64 [05:16<01:11,  5.53s/it]
 81%|████████▏ | 52/64 [05:23<01:13,  6.16s/it]
 83%|████████▎ | 53/64 [05:30<01:07,  6.15s/it]
 84%|████████▍ | 54/64 [05:40<01:15,  7.55s/it]
 86%|████████▌ | 55/64 [05:48<01:09,  7.67s/it]
 88%|████████▊ | 56/64 [05:52<00:50,  6.35s/it]
 89%|████████▉ | 57/64 [05:54<00:36,  5.19s/it]
 91%|█████████ | 58/64 [06:05<00:40,  6.83s/it]
 92%|█████████▏| 59/64 [06:12<00:34,  6.88s/it]
 94%|█████████▍| 60/64 [06:14<00:21,  5.45s/it]
 97%|█████████▋| 62/64 [06:27<00:12,  6.07s/it]
 98%|█████████▊| 63/64 [06:33<00:05,  6.00s/it]
100%|██████████| 64/64 [06:34<00:00,  4.66s/it]
100%|██████████| 64/64 [06:34<00:00,  6.17s/it]